OleksiiTimofieiev/stm8s-discovery/i2c/LSM6.h
/*******************************************************************************
* Register      : PEDO_THS
* Address       : 0X0F
* Bit Group Name: THS_VALUE
* Permission    : RW
*******************************************************************************/

#define LSM6DS3_CONFIG_PEDO_THS_VALUE 0x96

/*******************************************************************************
* Register      : PEDO_DEB_VALUE
* Address       : 0X14
* Bit Group Name: DEB_VALUE
* Permission    : RW
*******************************************************************************/

#define LSM6DS3_CONFIG_PEDO_DEB_VALUE 0x0E

/*******************************************************************************
* Register      : SM_THS_VALUE
* Address       : 0X13
* Bit Group Name: DEB_VALUE
* Permission    : RW
*******************************************************************************/

#define LSM6DS3_SM_STEP_THS_VALUE	0x8A
/*============================================================================
Enums
============================================================================*/

// Return values
typedef enum{
  IMU_SUCCESS = 1,
  IMU_ERROR = 0,
} status_t;





/*******************************************************************************
* Register      : RAM_ACCESS
* Address       : 0X01
* Bit Group Name: PROG_RAM1
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_PROG_RAM1_DISABLED 		 = 0x00,
	LSM6DS3_PROG_RAM1_ENABLED 		 = 0x01,
} LSM6DS3_PROG_RAM1_t;

/*******************************************************************************
* Register      : RAM_ACCESS
* Address       : 0X01
* Bit Group Name: CUSTOMROM1
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_CUSTOMROM1_DISABLED 		 = 0x00,
	LSM6DS3_CUSTOMROM1_ENABLED 		 = 0x04,
} LSM6DS3_CUSTOMROM1_t;

/*******************************************************************************
* Register      : RAM_ACCESS
* Address       : 0X01
* Bit Group Name: RAM_PAGE
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_RAM_PAGE_DISABLED 		 = 0x00,
	LSM6DS3_RAM_PAGE_ENABLED 		 = 0x80,
} LSM6DS3_RAM_PAGE_t;

/*******************************************************************************
* Register      : SENSOR_SYNC_TIME
* Address       : 0X04
* Bit Group Name: TPH
* Permission    : RW
*******************************************************************************/
#define  	LSM6DS3_TPH_MASK  	0xFF
#define  	LSM6DS3_TPH_POSITION  	0

/*******************************************************************************
* Register      : SENSOR_SYNC_EN
* Address       : 0X05
* Bit Group Name: SYNC_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_SYNC_EN_DISABLED 		 = 0x00,
	LSM6DS3_SYNC_EN_ENABLED 		 = 0x01,
} LSM6DS3_SYNC_EN_t;

/*******************************************************************************
* Register      : SENSOR_SYNC_EN
* Address       : 0X05
* Bit Group Name: HP_RST
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_HP_RST_RST_OFF 		 = 0x00,
	LSM6DS3_HP_RST_RST_ON 		 = 0x02,
} LSM6DS3_HP_RST_t;

/*******************************************************************************
* Register      : FIFO_CTRL1
* Address       : 0X06
* Bit Group Name: WTM_FIFO
* Permission    : RW
*******************************************************************************/
#define  	LSM6DS3_WTM_FIFO_CTRL1_MASK  	0xFF
#define  	LSM6DS3_WTM_FIFO_CTRL1_POSITION  	0
#define  	LSM6DS3_WTM_FIFO_CTRL2_MASK  	0x0F
#define  	LSM6DS3_WTM_FIFO_CTRL2_POSITION  	0

/*******************************************************************************
* Register      : FIFO_CTRL2
* Address       : 0X07
* Bit Group Name: TIM_PEDO_FIFO_DRDY
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_TIM_PEDO_FIFO_DRDY_DISABLED 		 = 0x00,
	LSM6DS3_TIM_PEDO_FIFO_DRDY_ENABLED 		 = 0x40,
} LSM6DS3_TIM_PEDO_FIFO_DRDY_t;

/*******************************************************************************
* Register      : FIFO_CTRL2
* Address       : 0X07
* Bit Group Name: TIM_PEDO_FIFO_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_TIM_PEDO_FIFO_EN_DISABLED 		 = 0x00,
	LSM6DS3_TIM_PEDO_FIFO_EN_ENABLED 		 = 0x80,
} LSM6DS3_TIM_PEDO_FIFO_EN_t;

/*******************************************************************************
* Register      : FIFO_CTRL3
* Address       : 0X08
* Bit Group Name: DEC_FIFO_XL
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_DEC_FIFO_XL_DATA_NOT_IN_FIFO 		 = 0x00,
	LSM6DS3_DEC_FIFO_XL_NO_DECIMATION 		 = 0x01,
	LSM6DS3_DEC_FIFO_XL_DECIMATION_BY_2 		 = 0x02,
	LSM6DS3_DEC_FIFO_XL_DECIMATION_BY_3 		 = 0x03,
	LSM6DS3_DEC_FIFO_XL_DECIMATION_BY_4 		 = 0x04,
	LSM6DS3_DEC_FIFO_XL_DECIMATION_BY_8 		 = 0x05,
	LSM6DS3_DEC_FIFO_XL_DECIMATION_BY_16 		 = 0x06,
	LSM6DS3_DEC_FIFO_XL_DECIMATION_BY_32 		 = 0x07,
} LSM6DS3_DEC_FIFO_XL_t;

/*******************************************************************************
* Register      : FIFO_CTRL3
* Address       : 0X08
* Bit Group Name: DEC_FIFO_G
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_DEC_FIFO_G_DATA_NOT_IN_FIFO 		 = 0x00,
	LSM6DS3_DEC_FIFO_G_NO_DECIMATION 		 = 0x08,
	LSM6DS3_DEC_FIFO_G_DECIMATION_BY_2 		 = 0x10,
	LSM6DS3_DEC_FIFO_G_DECIMATION_BY_3 		 = 0x18,
	LSM6DS3_DEC_FIFO_G_DECIMATION_BY_4 		 = 0x20,
	LSM6DS3_DEC_FIFO_G_DECIMATION_BY_8 		 = 0x28,
	LSM6DS3_DEC_FIFO_G_DECIMATION_BY_16 		 = 0x30,
	LSM6DS3_DEC_FIFO_G_DECIMATION_BY_32 		 = 0x38,
} LSM6DS3_DEC_FIFO_G_t;

