OleksiiTimofieiev/stm8s-discovery/i2c/LSM6.h
/*******************************************************************************
* Register      : FIFO_CTRL4
* Address       : 0X09
* Bit Group Name: DEC_FIFO_SLV0
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_DEC_FIFO_SLV0_DATA_NOT_IN_FIFO 		 = 0x00,
	LSM6DS3_DEC_FIFO_SLV0_NO_DECIMATION 		 = 0x01,
	LSM6DS3_DEC_FIFO_SLV0_DECIMATION_BY_2 		 = 0x02,
	LSM6DS3_DEC_FIFO_SLV0_DECIMATION_BY_3 		 = 0x03,
	LSM6DS3_DEC_FIFO_SLV0_DECIMATION_BY_4 		 = 0x04,
	LSM6DS3_DEC_FIFO_SLV0_DECIMATION_BY_8 		 = 0x05,
	LSM6DS3_DEC_FIFO_SLV0_DECIMATION_BY_16 		 = 0x06,
	LSM6DS3_DEC_FIFO_SLV0_DECIMATION_BY_32 		 = 0x07,
} LSM6DS3_DEC_FIFO_SLV0_t;

/*******************************************************************************
* Register      : FIFO_CTRL4
* Address       : 0X09
* Bit Group Name: DEC_FIFO_SLV1
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_DEC_FIFO_SLV1_DATA_NOT_IN_FIFO 		 = 0x00,
	LSM6DS3_DEC_FIFO_SLV1_NO_DECIMATION 		 = 0x08,
	LSM6DS3_DEC_FIFO_SLV1_DECIMATION_BY_2 		 = 0x10,
	LSM6DS3_DEC_FIFO_SLV1_DECIMATION_BY_3 		 = 0x18,
	LSM6DS3_DEC_FIFO_SLV1_DECIMATION_BY_4 		 = 0x20,
	LSM6DS3_DEC_FIFO_SLV1_DECIMATION_BY_8 		 = 0x28,
	LSM6DS3_DEC_FIFO_SLV1_DECIMATION_BY_16 		 = 0x30,
	LSM6DS3_DEC_FIFO_SLV1_DECIMATION_BY_32 		 = 0x38,
} LSM6DS3_DEC_FIFO_SLV1_t;

/*******************************************************************************
* Register      : FIFO_CTRL4
* Address       : 0X09
* Bit Group Name: HI_DATA_ONLY
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_HI_DATA_ONLY_DISABLED 		 = 0x00,
	LSM6DS3_HI_DATA_ONLY_ENABLED 		 = 0x40,
} LSM6DS3_HI_DATA_ONLY_t;

/*******************************************************************************
* Register      : FIFO_CTRL5
* Address       : 0X0A
* Bit Group Name: FIFO_MODE
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_FIFO_MODE_BYPASS 		 = 0x00,
	LSM6DS3_FIFO_MODE_FIFO 		 = 0x01,
	LSM6DS3_FIFO_MODE_STREAM 		 = 0x02,
	LSM6DS3_FIFO_MODE_STF 		 = 0x03,
	LSM6DS3_FIFO_MODE_BTS 		 = 0x04,
	LSM6DS3_FIFO_MODE_DYN_STREAM 		 = 0x05,
	LSM6DS3_FIFO_MODE_DYN_STREAM_2 		 = 0x06,
	LSM6DS3_FIFO_MODE_BTF 		 = 0x07,
} LSM6DS3_FIFO_MODE_t;

/*******************************************************************************
* Register      : FIFO_CTRL5
* Address       : 0X0A
* Bit Group Name: ODR_FIFO
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_ODR_FIFO_10Hz 		 = 0x08,
	LSM6DS3_ODR_FIFO_25Hz 		 = 0x10,
	LSM6DS3_ODR_FIFO_50Hz 		 = 0x18,
	LSM6DS3_ODR_FIFO_100Hz 		 = 0x20,
	LSM6DS3_ODR_FIFO_200Hz 		 = 0x28,
	LSM6DS3_ODR_FIFO_400Hz 		 = 0x30,
	LSM6DS3_ODR_FIFO_800Hz 		 = 0x38,
	LSM6DS3_ODR_FIFO_1600Hz 		 = 0x40,
	LSM6DS3_ODR_FIFO_3300Hz 		 = 0x48,
	LSM6DS3_ODR_FIFO_6600Hz 		 = 0x50,
	LSM6DS3_ODR_FIFO_13300Hz 		 = 0x58,
} LSM6DS3_ODR_FIFO_t;

/*******************************************************************************
* Register      : ORIENT_CFG_G
* Address       : 0X0B
* Bit Group Name: ORIENT
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_ORIENT_XYZ 		 = 0x00,
	LSM6DS3_ORIENT_XZY 		 = 0x01,
	LSM6DS3_ORIENT_YXZ 		 = 0x02,
	LSM6DS3_ORIENT_YZX 		 = 0x03,
	LSM6DS3_ORIENT_ZXY 		 = 0x04,
	LSM6DS3_ORIENT_ZYX 		 = 0x05,
} LSM6DS3_ORIENT_t;

/*******************************************************************************
* Register      : ORIENT_CFG_G
* Address       : 0X0B
* Bit Group Name: SIGN_Z_G
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_SIGN_Z_G_POSITIVE 		 = 0x00,
	LSM6DS3_SIGN_Z_G_NEGATIVE 		 = 0x08,
} LSM6DS3_SIGN_Z_G_t;

/*******************************************************************************
* Register      : ORIENT_CFG_G
* Address       : 0X0B
* Bit Group Name: SIGN_Y_G
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_SIGN_Y_G_POSITIVE 		 = 0x00,
	LSM6DS3_SIGN_Y_G_NEGATIVE 		 = 0x10,
} LSM6DS3_SIGN_Y_G_t;

/*******************************************************************************
* Register      : ORIENT_CFG_G
* Address       : 0X0B
* Bit Group Name: SIGN_X_G
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_SIGN_X_G_POSITIVE 		 = 0x00,
	LSM6DS3_SIGN_X_G_NEGATIVE 		 = 0x20,
} LSM6DS3_SIGN_X_G_t;

/*******************************************************************************
* Register      : REFERENCE_G
* Address       : 0X0C
* Bit Group Name: REF_G
* Permission    : RW
*******************************************************************************/
#define  	LSM6DS3_REF_G_MASK  	0xFF
#define  	LSM6DS3_REF_G_POSITION  	0

/*******************************************************************************
* Register      : INT1_CTRL
* Address       : 0X0D
* Bit Group Name: INT1_DRDY_XL
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT1_DRDY_XL_DISABLED 		 = 0x00,
	LSM6DS3_INT1_DRDY_XL_ENABLED 		 = 0x01,
} LSM6DS3_INT1_DRDY_XL_t;

/*******************************************************************************
* Register      : INT1_CTRL
* Address       : 0X0D
* Bit Group Name: INT1_DRDY_G
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT1_DRDY_G_DISABLED 		 = 0x00,
	LSM6DS3_INT1_DRDY_G_ENABLED 		 = 0x02,
} LSM6DS3_INT1_DRDY_G_t;

/*******************************************************************************
* Register      : INT1_CTRL
* Address       : 0X0D
* Bit Group Name: INT1_BOOT
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT1_BOOT_DISABLED 		 = 0x00,
	LSM6DS3_INT1_BOOT_ENABLED 		 = 0x04,
} LSM6DS3_INT1_BOOT_t;

