OleksiiTimofieiev/stm8s-discovery/i2c/LSM6.h
/*******************************************************************************
* Register      : INT1_CTRL
* Address       : 0X0D
* Bit Group Name: INT1_FTH
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT1_FTH_DISABLED 		 = 0x00,
	LSM6DS3_INT1_FTH_ENABLED 		 = 0x08,
} LSM6DS3_INT1_FTH_t;

/*******************************************************************************
* Register      : INT1_CTRL
* Address       : 0X0D
* Bit Group Name: INT1_OVR
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT1_OVR_DISABLED 		 = 0x00,
	LSM6DS3_INT1_OVR_ENABLED 		 = 0x10,
} LSM6DS3_INT1_OVR_t;

/*******************************************************************************
* Register      : INT1_CTRL
* Address       : 0X0D
* Bit Group Name: INT1_FSS5
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT1_FSS5_DISABLED 		 = 0x00,
	LSM6DS3_INT1_FSS5_ENABLED 		 = 0x20,
} LSM6DS3_INT1_FSS5_t;

/*******************************************************************************
* Register      : INT1_CTRL
* Address       : 0X0D
* Bit Group Name: INT1_SIGN_MOT
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT1_SIGN_MOT_DISABLED 		 = 0x00,
	LSM6DS3_INT1_SIGN_MOT_ENABLED 		 = 0x40,
} LSM6DS3_INT1_SIGN_MOT_t;

/*******************************************************************************
* Register      : INT1_CTRL
* Address       : 0X0D
* Bit Group Name: INT1_PEDO
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT1_PEDO_DISABLED 		 = 0x00,
	LSM6DS3_INT1_PEDO_ENABLED 		 = 0x80,
} LSM6DS3_INT1_PEDO_t;

/*******************************************************************************
* Register      : INT2_CTRL
* Address       : 0X0E
* Bit Group Name: INT2_DRDY_XL
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT2_DRDY_XL_DISABLED 		 = 0x00,
	LSM6DS3_INT2_DRDY_XL_ENABLED 		 = 0x01,
} LSM6DS3_INT2_DRDY_XL_t;

/*******************************************************************************
* Register      : INT2_CTRL
* Address       : 0X0E
* Bit Group Name: INT2_DRDY_G
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT2_DRDY_G_DISABLED 		 = 0x00,
	LSM6DS3_INT2_DRDY_G_ENABLED 		 = 0x02,
} LSM6DS3_INT2_DRDY_G_t;

/*******************************************************************************
* Register      : INT2_CTRL
* Address       : 0X0E
* Bit Group Name: INT2_FTH
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT2_FTH_DISABLED 		 = 0x00,
	LSM6DS3_INT2_FTH_ENABLED 		 = 0x08,
} LSM6DS3_INT2_FTH_t;

/*******************************************************************************
* Register      : INT2_CTRL
* Address       : 0X0E
* Bit Group Name: INT2_OVR
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT2_OVR_DISABLED 		 = 0x00,
	LSM6DS3_INT2_OVR_ENABLED 		 = 0x10,
} LSM6DS3_INT2_OVR_t;

/*******************************************************************************
* Register      : INT2_CTRL
* Address       : 0X0E
* Bit Group Name: INT2_FSS5
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT2_FSS5_DISABLED 		 = 0x00,
	LSM6DS3_INT2_FSS5_ENABLED 		 = 0x20,
} LSM6DS3_INT2_FSS5_t;

/*******************************************************************************
* Register      : INT2_CTRL
* Address       : 0X0E
* Bit Group Name: INT2_SIGN_MOT
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT2_SIGN_MOT_DISABLED 		 = 0x00,
	LSM6DS3_INT2_SIGN_MOT_ENABLED 		 = 0x40,
} LSM6DS3_INT2_SIGN_MOT_t;

/*******************************************************************************
* Register      : INT2_CTRL
* Address       : 0X0E
* Bit Group Name: INT2_PEDO
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT2_PEDO_DISABLED 		 = 0x00,
	LSM6DS3_INT2_PEDO_ENABLED 		 = 0x80,
} LSM6DS3_INT2_PEDO_t;

/*******************************************************************************
* Register      : WHO_AM_I
* Address       : 0X0F
* Bit Group Name: WHO_AM_I_BIT
* Permission    : RO
*******************************************************************************/
#define  	LSM6DS3_WHO_AM_I_BIT_MASK  	0xFF
#define  	LSM6DS3_WHO_AM_I_BIT_POSITION  	0

/*******************************************************************************
* Register      : CTRL1_XL
* Address       : 0X10
* Bit Group Name: BW_XL
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_BW_XL_400Hz 		 = 0x00,
	LSM6DS3_BW_XL_200Hz 		 = 0x01,
	LSM6DS3_BW_XL_100Hz 		 = 0x02,
	LSM6DS3_BW_XL_50Hz 		 = 0x03,
} LSM6DS3_BW_XL_t;

/*******************************************************************************
* Register      : CTRL1_XL
* Address       : 0X10
* Bit Group Name: FS_XL
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_FS_XL_2g 		 = 0x00,
	LSM6DS3_FS_XL_16g 		 = 0x01,
	LSM6DS3_FS_XL_4g 		 = 0x02,
	LSM6DS3_FS_XL_8g 		 = 0x03,
} LSM6DS3_FS_XL_t;

/*******************************************************************************
* Register      : CTRL1_XL
* Address       : 0X10
* Bit Group Name: ODR_XL
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_ODR_XL_POWER_DOWN 		 = 0x00,
	LSM6DS3_ODR_XL_13Hz 		         = 0x10,
	LSM6DS3_ODR_XL_26Hz 		         = 0x20,
	LSM6DS3_ODR_XL_52Hz 		         = 0x30,
	LSM6DS3_ODR_XL_104Hz 		 = 0x40,
	LSM6DS3_ODR_XL_208Hz 		 = 0x50,
	LSM6DS3_ODR_XL_416Hz 		 = 0x60,
	LSM6DS3_ODR_XL_833Hz 		 = 0x70,
	LSM6DS3_ODR_XL_1660Hz 		 = 0x80,
	LSM6DS3_ODR_XL_3330Hz 		 = 0x90,
	LSM6DS3_ODR_XL_6660Hz 		 = 0xA0,
	LSM6DS3_ODR_XL_13330Hz 		 = 0xB0,
} LSM6DS3_ODR_XL_t;

