OleksiiTimofieiev/stm8s-discovery/i2c/LSM6.h
/*******************************************************************************
* Register      : CTRL2_G
* Address       : 0X11
* Bit Group Name: FS_125
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_FS_125_DISABLED          = 0x00,
	LSM6DS3_FS_125_ENABLED 		 = 0x02,
} LSM6DS3_FS_125_t;

/*******************************************************************************
* Register      : CTRL2_G
* Address       : 0X11
* Bit Group Name: FS_G
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_FS_G_245dps 		 = 0x00,
	LSM6DS3_FS_G_500dps 		 = 0x01,
	LSM6DS3_FS_G_1000dps 		 = 0x02,
	LSM6DS3_FS_G_2000dps 		 = 0x03,
} LSM6DS3_FS_G_t;

/*******************************************************************************
* Register      : CTRL2_G
* Address       : 0X11
* Bit Group Name: ODR_G
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_ODR_G_POWER_DOWN 	 = 0x00,
	LSM6DS3_ODR_G_13Hz 		 = 0x10,
	LSM6DS3_ODR_G_26Hz 		 = 0x20,
	LSM6DS3_ODR_G_52Hz 		 = 0x30,
	LSM6DS3_ODR_G_104Hz 		 = 0x40,
	LSM6DS3_ODR_G_208Hz 		 = 0x50,
	LSM6DS3_ODR_G_416Hz 		 = 0x60,
	LSM6DS3_ODR_G_833Hz 		 = 0x70,
	LSM6DS3_ODR_G_1660Hz 		 = 0x80,
} LSM6DS3_ODR_G_t;

/*******************************************************************************
* Register      : CTRL3_C
* Address       : 0X12
* Bit Group Name: SW_RESET
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_SW_RESET_NORMAL_MODE 		 = 0x00,
	LSM6DS3_SW_RESET_RESET_DEVICE 		 = 0x01,
} LSM6DS3_SW_RESET_t;

/*******************************************************************************
* Register      : CTRL3_C
* Address       : 0X12
* Bit Group Name: BLE
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_BLE_LSB 		 = 0x00,
	LSM6DS3_BLE_MSB 		 = 0x02,
} LSM6DS3_BLE_t;

/*******************************************************************************
* Register      : CTRL3_C
* Address       : 0X12
* Bit Group Name: IF_INC
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_IF_INC_DISABLED 		 = 0x00,
	LSM6DS3_IF_INC_ENABLED 		 = 0x04,
} LSM6DS3_IF_INC_t;

/*******************************************************************************
* Register      : CTRL3_C
* Address       : 0X12
* Bit Group Name: SIM
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_SIM_4_WIRE 		 = 0x00,
	LSM6DS3_SIM_3_WIRE 		 = 0x08,
} LSM6DS3_SIM_t;

/*******************************************************************************
* Register      : CTRL3_C
* Address       : 0X12
* Bit Group Name: PP_OD
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_PP_OD_PUSH_PULL 		 = 0x00,
	LSM6DS3_PP_OD_OPEN_DRAIN 		 = 0x10,
} LSM6DS3_PP_OD_t;

/*******************************************************************************
* Register      : CTRL3_C
* Address       : 0X12
* Bit Group Name: INT_ACT_LEVEL
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT_ACT_LEVEL_ACTIVE_HI 		 = 0x00,
	LSM6DS3_INT_ACT_LEVEL_ACTIVE_LO 		 = 0x20,
} LSM6DS3_INT_ACT_LEVEL_t;

/*******************************************************************************
* Register      : CTRL3_C
* Address       : 0X12
* Bit Group Name: BDU
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_BDU_CONTINUOS 		 = 0x00,
	LSM6DS3_BDU_BLOCK_UPDATE 		 = 0x40,
} LSM6DS3_BDU_t;

/*******************************************************************************
* Register      : CTRL3_C
* Address       : 0X12
* Bit Group Name: BOOT
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_BOOT_NORMAL_MODE 		 = 0x00,
	LSM6DS3_BOOT_REBOOT_MODE 		 = 0x80,
} LSM6DS3_BOOT_t;

/*******************************************************************************
* Register      : CTRL4_C
* Address       : 0X13
* Bit Group Name: STOP_ON_FTH
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_STOP_ON_FTH_DISABLED 		 = 0x00,
	LSM6DS3_STOP_ON_FTH_ENABLED 		 = 0x01,
} LSM6DS3_STOP_ON_FTH_t;

/*******************************************************************************
* Register      : CTRL4_C
* Address       : 0X13
* Bit Group Name: MODE3_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_MODE3_EN_DISABLED 		 = 0x00,
	LSM6DS3_MODE3_EN_ENABLED 		 = 0x02,
} LSM6DS3_MODE3_EN_t;

/*******************************************************************************
* Register      : CTRL4_C
* Address       : 0X13
* Bit Group Name: I2C_DISABLE
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_I2C_DISABLE_I2C_AND_SPI 		 = 0x00,
	LSM6DS3_I2C_DISABLE_SPI_ONLY 		 = 0x04,
} LSM6DS3_I2C_DISABLE_t;

/*******************************************************************************
* Register      : CTRL4_C
* Address       : 0X13
* Bit Group Name: DRDY_MSK
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_DRDY_MSK_DISABLED 		 = 0x00,
	LSM6DS3_DRDY_MSK_ENABLED 		 = 0x08,
} LSM6DS3_DRDY_MSK_t;

/*******************************************************************************
* Register      : CTRL4_C
* Address       : 0X13
* Bit Group Name: FIFO_TEMP_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_FIFO_TEMP_EN_DISABLED 		 = 0x00,
	LSM6DS3_FIFO_TEMP_EN_ENABLED 		 = 0x10,
} LSM6DS3_FIFO_TEMP_EN_t;

