OleksiiTimofieiev/stm8s-discovery/i2c/LSM6.h
/*******************************************************************************
* Register      : CTRL4_C
* Address       : 0X13
* Bit Group Name: INT2_ON_INT1
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT2_ON_INT1_DISABLED 		 = 0x00,
	LSM6DS3_INT2_ON_INT1_ENABLED 		 = 0x20,
} LSM6DS3_INT2_ON_INT1_t;

/*******************************************************************************
* Register      : CTRL4_C
* Address       : 0X13
* Bit Group Name: SLEEP_G
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_SLEEP_G_DISABLED 		 = 0x00,
	LSM6DS3_SLEEP_G_ENABLED 		 = 0x40,
} LSM6DS3_SLEEP_G_t;

/*******************************************************************************
* Register      : CTRL4_C
* Address       : 0X13
* Bit Group Name: BW_SCAL_ODR
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_BW_SCAL_ODR_DISABLED 		 = 0x00,
	LSM6DS3_BW_SCAL_ODR_ENABLED 		 = 0x80,
} LSM6DS3_BW_SCAL_ODR_t;

/*******************************************************************************
* Register      : CTRL5_C
* Address       : 0X14
* Bit Group Name: ST_XL
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_ST_XL_NORMAL_MODE 		 = 0x00,
	LSM6DS3_ST_XL_POS_SIGN_TEST 		 = 0x01,
	LSM6DS3_ST_XL_NEG_SIGN_TEST 		 = 0x02,
	LSM6DS3_ST_XL_NA 		 = 0x03,
} LSM6DS3_ST_XL_t;

/*******************************************************************************
* Register      : CTRL5_C
* Address       : 0X14
* Bit Group Name: ST_G
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_ST_G_NORMAL_MODE 		 = 0x00,
	LSM6DS3_ST_G_POS_SIGN_TEST 		 = 0x04,
	LSM6DS3_ST_G_NA 		 = 0x08,
	LSM6DS3_ST_G_NEG_SIGN_TEST 		 = 0x0C,
} LSM6DS3_ST_G_t;

/*******************************************************************************
* Register      : CTRL6_G
* Address       : 0X15
* Bit Group Name: LP_XL
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_LP_XL_DISABLED 		 = 0x00,
	LSM6DS3_LP_XL_ENABLED 		 = 0x10,
} LSM6DS3_LP_XL_t;

/*******************************************************************************
* Register      : CTRL6_G
* Address       : 0X15
* Bit Group Name: DEN_LVL2_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_DEN_LVL2_EN_DISABLED 		 = 0x00,
	LSM6DS3_DEN_LVL2_EN_ENABLED 		 = 0x20,
} LSM6DS3_DEN_LVL2_EN_t;

/*******************************************************************************
* Register      : CTRL6_G
* Address       : 0X15
* Bit Group Name: DEN_LVL_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_DEN_LVL_EN_DISABLED 		 = 0x00,
	LSM6DS3_DEN_LVL_EN_ENABLED 		 = 0x40,
} LSM6DS3_DEN_LVL_EN_t;

/*******************************************************************************
* Register      : CTRL6_G
* Address       : 0X15
* Bit Group Name: DEN_EDGE_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_DEN_EDGE_EN_DISABLED 		 = 0x00,
	LSM6DS3_DEN_EDGE_EN_ENABLED 		 = 0x80,
} LSM6DS3_DEN_EDGE_EN_t;

/*******************************************************************************
* Register      : CTRL7_G
* Address       : 0X16
* Bit Group Name: HPM_G
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_HPM_G_NORMAL_MODE 		 = 0x00,
	LSM6DS3_HPM_G_REF_SIGNAL 		 = 0x10,
	LSM6DS3_HPM_G_NORMAL_MODE_2 		 = 0x20,
	LSM6DS3_HPM_G_AUTO_RESET_ON_INT 		 = 0x30,
} LSM6DS3_HPM_G_t;

/*******************************************************************************
* Register      : CTRL7_G
* Address       : 0X16
* Bit Group Name: HP_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_HP_EN_DISABLED 		 = 0x00,
	LSM6DS3_HP_EN_ENABLED 		 = 0x40,
} LSM6DS3_HP_EN_t;

/*******************************************************************************
* Register      : CTRL7_G
* Address       : 0X16
* Bit Group Name: LP_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_LP_EN_DISABLED 		 = 0x00,
	LSM6DS3_LP_EN_ENABLED 		 = 0x80,
} LSM6DS3_LP_EN_t;

/*******************************************************************************
* Register      : CTRL8_XL
* Address       : 0X17
* Bit Group Name: FDS
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_FDS_FILTER_OFF 		 = 0x00,
	LSM6DS3_FDS_FILTER_ON 		 = 0x04,
} LSM6DS3_FDS_t;

/*******************************************************************************
* Register      : CTRL9_XL
* Address       : 0X18
* Bit Group Name: XEN_XL
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_XEN_XL_DISABLED 		 = 0x00,
	LSM6DS3_XEN_XL_ENABLED 		 = 0x08,
} LSM6DS3_XEN_XL_t;

/*******************************************************************************
* Register      : CTRL9_XL
* Address       : 0X18
* Bit Group Name: YEN_XL
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_YEN_XL_DISABLED 		 = 0x00,
	LSM6DS3_YEN_XL_ENABLED 		 = 0x10,
} LSM6DS3_YEN_XL_t;

/*******************************************************************************
* Register      : CTRL9_XL
* Address       : 0X18
* Bit Group Name: ZEN_XL
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_ZEN_XL_DISABLED 		 = 0x00,
	LSM6DS3_ZEN_XL_ENABLED 		 = 0x20,
} LSM6DS3_ZEN_XL_t;

