OleksiiTimofieiev/stm8s-discovery/i2c/LSM6.h
/*******************************************************************************
* Register      : CTRL10_C
* Address       : 0X19
* Bit Group Name: SIGN_MOTION_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_SIGN_MOTION_EN_DISABLED 		 = 0x00,
	LSM6DS3_SIGN_MOTION_EN_ENABLED 		 = 0x01,
} LSM6DS3_SIGN_MOTION_EN_t;

/*******************************************************************************
* Register      : CTRL10_C
* Address       : 0X19
* Bit Group Name: PEDO_RST_STEP
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_PEDO_RST_STEP_DISABLED 		 = 0x00,
	LSM6DS3_PEDO_RST_STEP_ENABLED 		 = 0x02,
} LSM6DS3_PEDO_RST_STEP_t;

/*******************************************************************************
* Register      : CTRL10_C
* Address       : 0X19
* Bit Group Name: XEN_G
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_XEN_G_DISABLED 		 = 0x00,
	LSM6DS3_XEN_G_ENABLED 		 = 0x08,
} LSM6DS3_XEN_G_t;

/*******************************************************************************
* Register      : CTRL10_C
* Address       : 0X19
* Bit Group Name: YEN_G
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_YEN_G_DISABLED 		 = 0x00,
	LSM6DS3_YEN_G_ENABLED 		 = 0x10,
} LSM6DS3_YEN_G_t;

/*******************************************************************************
* Register      : CTRL10_C
* Address       : 0X19
* Bit Group Name: ZEN_G
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_ZEN_G_DISABLED 		 = 0x00,
	LSM6DS3_ZEN_G_ENABLED 		 = 0x20,
} LSM6DS3_ZEN_G_t;

/*******************************************************************************
* Register      : CTRL10_C
* Address       : 0X19
* Bit Group Name: FUNC_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_FUNC_EN_DISABLED 		 = 0x00,
	LSM6DS3_FUNC_EN_ENABLED 		 = 0x04,
} LSM6DS3_FUNC_EN_t;

/*******************************************************************************
* Register      : MASTER_CONFIG
* Address       : 0X1A
* Bit Group Name: MASTER_ON
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_MASTER_ON_DISABLED 		 = 0x00,
	LSM6DS3_MASTER_ON_ENABLED 		 = 0x01,
} LSM6DS3_MASTER_ON_t;

/*******************************************************************************
* Register      : MASTER_CONFIG
* Address       : 0X1A
* Bit Group Name: IRON_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_IRON_EN_DISABLED 		 = 0x00,
	LSM6DS3_IRON_EN_ENABLED 		 = 0x02,
} LSM6DS3_IRON_EN_t;

/*******************************************************************************
* Register      : MASTER_CONFIG
* Address       : 0X1A
* Bit Group Name: PASS_THRU_MODE
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_PASS_THRU_MODE_DISABLED 		 = 0x00,
	LSM6DS3_PASS_THRU_MODE_ENABLED 		 = 0x04,
} LSM6DS3_PASS_THRU_MODE_t;

/*******************************************************************************
* Register      : MASTER_CONFIG
* Address       : 0X1A
* Bit Group Name: PULL_UP_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_PULL_UP_EN_DISABLED 		 = 0x00,
	LSM6DS3_PULL_UP_EN_ENABLED 		 = 0x08,
} LSM6DS3_PULL_UP_EN_t;

/*******************************************************************************
* Register      : MASTER_CONFIG
* Address       : 0X1A
* Bit Group Name: START_CONFIG
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_START_CONFIG_XL_G_DRDY 		 = 0x00,
	LSM6DS3_START_CONFIG_EXT_INT2 		 = 0x10,
} LSM6DS3_START_CONFIG_t;

/*******************************************************************************
* Register      : MASTER_CONFIG
* Address       : 0X1A
* Bit Group Name: DATA_VAL_SEL_FIFO
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_DATA_VAL_SEL_FIFO_XL_G_DRDY 		 = 0x00,
	LSM6DS3_DATA_VAL_SEL_FIFO_SHUB_DRDY 		 = 0x40,
} LSM6DS3_DATA_VAL_SEL_FIFO_t;

/*******************************************************************************
* Register      : MASTER_CONFIG
* Address       : 0X1A
* Bit Group Name: DRDY_ON_INT1
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_DRDY_ON_INT1_DISABLED 		 = 0x00,
	LSM6DS3_DRDY_ON_INT1_ENABLED 		 = 0x80,
} LSM6DS3_DRDY_ON_INT1_t;

/*******************************************************************************
* Register      : WAKE_UP_SRC
* Address       : 0X1B
* Bit Group Name: Z_WU
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_Z_WU_NOT_DETECTED 		 = 0x00,
	LSM6DS3_Z_WU_DETECTED 		 = 0x01,
} LSM6DS3_Z_WU_t;

/*******************************************************************************
* Register      : WAKE_UP_SRC
* Address       : 0X1B
* Bit Group Name: Y_WU
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_Y_WU_NOT_DETECTED 		 = 0x00,
	LSM6DS3_Y_WU_DETECTED 		 = 0x02,
} LSM6DS3_Y_WU_t;

/*******************************************************************************
* Register      : WAKE_UP_SRC
* Address       : 0X1B
* Bit Group Name: X_WU
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_X_WU_NOT_DETECTED 		 = 0x00,
	LSM6DS3_X_WU_DETECTED 		 = 0x04,
} LSM6DS3_X_WU_t;

