OleksiiTimofieiev/stm8s-discovery/i2c/LSM6.h
/*******************************************************************************
* Register      : WAKE_UP_SRC
* Address       : 0X1B
* Bit Group Name: WU_EV_STATUS
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_WU_EV_STATUS_NOT_DETECTED 		 = 0x00,
	LSM6DS3_WU_EV_STATUS_DETECTED 		 = 0x08,
} LSM6DS3_WU_EV_STATUS_t;

/*******************************************************************************
* Register      : WAKE_UP_SRC
* Address       : 0X1B
* Bit Group Name: SLEEP_EV_STATUS
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_SLEEP_EV_STATUS_NOT_DETECTED 		 = 0x00,
	LSM6DS3_SLEEP_EV_STATUS_DETECTED 		 = 0x10,
} LSM6DS3_SLEEP_EV_STATUS_t;

/*******************************************************************************
* Register      : WAKE_UP_SRC
* Address       : 0X1B
* Bit Group Name: FF_EV_STATUS
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_FF_EV_STATUS_NOT_DETECTED 		 = 0x00,
	LSM6DS3_FF_EV_STATUS_DETECTED 		 = 0x20,
} LSM6DS3_FF_EV_STATUS_t;

/*******************************************************************************
* Register      : TAP_SRC
* Address       : 0X1C
* Bit Group Name: Z_TAP
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_Z_TAP_NOT_DETECTED 		 = 0x00,
	LSM6DS3_Z_TAP_DETECTED 		 = 0x01,
} LSM6DS3_Z_TAP_t;

/*******************************************************************************
* Register      : TAP_SRC
* Address       : 0X1C
* Bit Group Name: Y_TAP
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_Y_TAP_NOT_DETECTED 		 = 0x00,
	LSM6DS3_Y_TAP_DETECTED 		 = 0x02,
} LSM6DS3_Y_TAP_t;

/*******************************************************************************
* Register      : TAP_SRC
* Address       : 0X1C
* Bit Group Name: X_TAP
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_X_TAP_NOT_DETECTED 		 = 0x00,
	LSM6DS3_X_TAP_DETECTED 		 = 0x04,
} LSM6DS3_X_TAP_t;

/*******************************************************************************
* Register      : TAP_SRC
* Address       : 0X1C
* Bit Group Name: TAP_SIGN
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_TAP_SIGN_POS_SIGN 		 = 0x00,
	LSM6DS3_TAP_SIGN_NEG_SIGN 		 = 0x08,
} LSM6DS3_TAP_SIGN_t;

/*******************************************************************************
* Register      : TAP_SRC
* Address       : 0X1C
* Bit Group Name: DOUBLE_TAP_EV_STATUS
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_DOUBLE_TAP_EV_STATUS_NOT_DETECTED 		 = 0x00,
	LSM6DS3_DOUBLE_TAP_EV_STATUS_DETECTED 		 = 0x10,
} LSM6DS3_DOUBLE_TAP_EV_STATUS_t;

/*******************************************************************************
* Register      : TAP_SRC
* Address       : 0X1C
* Bit Group Name: SINGLE_TAP_EV_STATUS
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_SINGLE_TAP_EV_STATUS_NOT_DETECTED 		 = 0x00,
	LSM6DS3_SINGLE_TAP_EV_STATUS_DETECTED 		 = 0x20,
} LSM6DS3_SINGLE_TAP_EV_STATUS_t;

/*******************************************************************************
* Register      : TAP_SRC
* Address       : 0X1C
* Bit Group Name: TAP_EV_STATUS
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_TAP_EV_STATUS_NOT_DETECTED 		 = 0x00,
	LSM6DS3_TAP_EV_STATUS_DETECTED 		 = 0x40,
} LSM6DS3_TAP_EV_STATUS_t;

/*******************************************************************************
* Register      : D6D_SRC
* Address       : 0X1D
* Bit Group Name: DSD_XL
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_DSD_XL_NOT_DETECTED 		 = 0x00,
	LSM6DS3_DSD_XL_DETECTED 		 = 0x01,
} LSM6DS3_DSD_XL_t;

/*******************************************************************************
* Register      : D6D_SRC
* Address       : 0X1D
* Bit Group Name: DSD_XH
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_DSD_XH_NOT_DETECTED 		 = 0x00,
	LSM6DS3_DSD_XH_DETECTED 		 = 0x02,
} LSM6DS3_DSD_XH_t;

/*******************************************************************************
* Register      : D6D_SRC
* Address       : 0X1D
* Bit Group Name: DSD_YL
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_DSD_YL_NOT_DETECTED 		 = 0x00,
	LSM6DS3_DSD_YL_DETECTED 		 = 0x04,
} LSM6DS3_DSD_YL_t;

/*******************************************************************************
* Register      : D6D_SRC
* Address       : 0X1D
* Bit Group Name: DSD_YH
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_DSD_YH_NOT_DETECTED 		 = 0x00,
	LSM6DS3_DSD_YH_DETECTED 		 = 0x08,
} LSM6DS3_DSD_YH_t;

/*******************************************************************************
* Register      : D6D_SRC
* Address       : 0X1D
* Bit Group Name: DSD_ZL
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_DSD_ZL_NOT_DETECTED 		 = 0x00,
	LSM6DS3_DSD_ZL_DETECTED 		 = 0x10,
} LSM6DS3_DSD_ZL_t;

/*******************************************************************************
* Register      : D6D_SRC
* Address       : 0X1D
* Bit Group Name: DSD_ZH
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_DSD_ZH_NOT_DETECTED 		 = 0x00,
	LSM6DS3_DSD_ZH_DETECTED 		 = 0x20,
} LSM6DS3_DSD_ZH_t;

