OleksiiTimofieiev/stm8s-discovery/i2c/LSM6.h
/*******************************************************************************
* Register      : D6D_SRC
* Address       : 0X1D
* Bit Group Name: D6D_EV_STATUS
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_D6D_EV_STATUS_NOT_DETECTED 		 = 0x00,
	LSM6DS3_D6D_EV_STATUS_DETECTED 		 = 0x40,
} LSM6DS3_D6D_EV_STATUS_t;

/*******************************************************************************
* Register      : STATUS_REG
* Address       : 0X1E
* Bit Group Name: XLDA
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_XLDA_NO_DATA_AVAIL 		 = 0x00,
	LSM6DS3_XLDA_DATA_AVAIL 		 = 0x01,
} LSM6DS3_XLDA_t;

/*******************************************************************************
* Register      : STATUS_REG
* Address       : 0X1E
* Bit Group Name: GDA
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_GDA_NO_DATA_AVAIL 		 = 0x00,
	LSM6DS3_GDA_DATA_AVAIL 		 = 0x02,
} LSM6DS3_GDA_t;

/*******************************************************************************
* Register      : STATUS_REG
* Address       : 0X1E
* Bit Group Name: EV_BOOT
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_EV_BOOT_NO_BOOT_RUNNING 		 = 0x00,
	LSM6DS3_EV_BOOT_BOOT_IS_RUNNING 		 = 0x08,
} LSM6DS3_EV_BOOT_t;

/*******************************************************************************
* Register      : FIFO_STATUS1
* Address       : 0X3A
* Bit Group Name: DIFF_FIFO
* Permission    : RO
*******************************************************************************/
#define  	LSM6DS3_DIFF_FIFO_STATUS1_MASK  	0xFF
#define  	LSM6DS3_DIFF_FIFO_STATUS1_POSITION  	0
#define  	LSM6DS3_DIFF_FIFO_STATUS2_MASK  0xF
#define  	LSM6DS3_DIFF_FIFO_STATUS2_POSITION  	0

/*******************************************************************************
* Register      : FIFO_STATUS2
* Address       : 0X3B
* Bit Group Name: FIFO_EMPTY
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_FIFO_EMPTY_FIFO_NOT_EMPTY 		 = 0x00,
	LSM6DS3_FIFO_EMPTY_FIFO_EMPTY 		 = 0x10,
} LSM6DS3_FIFO_EMPTY_t;

/*******************************************************************************
* Register      : FIFO_STATUS2
* Address       : 0X3B
* Bit Group Name: FIFO_FULL
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_FIFO_FULL_FIFO_NOT_FULL 		 = 0x00,
	LSM6DS3_FIFO_FULL_FIFO_FULL 		 = 0x20,
} LSM6DS3_FIFO_FULL_t;

/*******************************************************************************
* Register      : FIFO_STATUS2
* Address       : 0X3B
* Bit Group Name: OVERRUN
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_OVERRUN_NO_OVERRUN 		 = 0x00,
	LSM6DS3_OVERRUN_OVERRUN 		 = 0x40,
} LSM6DS3_OVERRUN_t;

/*******************************************************************************
* Register      : FIFO_STATUS2
* Address       : 0X3B
* Bit Group Name: WTM
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_WTM_BELOW_WTM 		 = 0x00,
	LSM6DS3_WTM_ABOVE_OR_EQUAL_WTM 		 = 0x80,
} LSM6DS3_WTM_t;

/*******************************************************************************
* Register      : FIFO_STATUS3
* Address       : 0X3C
* Bit Group Name: FIFO_PATTERN
* Permission    : RO
*******************************************************************************/
#define  	LSM6DS3_FIFO_STATUS3_PATTERN_MASK  	0xFF
#define  	LSM6DS3_FIFO_STATUS3_PATTERN_POSITION  	0
#define  	LSM6DS3_FIFO_STATUS4_PATTERN_MASK  	0x03
#define  	LSM6DS3_FIFO_STATUS4_PATTERN_POSITION  	0

/*******************************************************************************
* Register      : FUNC_SRC
* Address       : 0X53
* Bit Group Name: SENS_HUB_END
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_SENS_HUB_END_STILL_ONGOING 		 = 0x00,
	LSM6DS3_SENS_HUB_END_OP_COMPLETED 		 = 0x01,
} LSM6DS3_SENS_HUB_END_t;

/*******************************************************************************
* Register      : FUNC_SRC
* Address       : 0X53
* Bit Group Name: SOFT_IRON_END
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_SOFT_IRON_END_NOT_COMPLETED 		 = 0x00,
	LSM6DS3_SOFT_IRON_END_COMPLETED 		 = 0x02,
} LSM6DS3_SOFT_IRON_END_t;

/*******************************************************************************
* Register      : FUNC_SRC
* Address       : 0X53
* Bit Group Name: PEDO_EV_STATUS
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_PEDO_EV_STATUS_NOT_DETECTED 		 = 0x00,
	LSM6DS3_PEDO_EV_STATUS_DETECTED 		 = 0x10,
} LSM6DS3_PEDO_EV_STATUS_t;

/*******************************************************************************
* Register      : FUNC_SRC
* Address       : 0X53
* Bit Group Name: TILT_EV_STATUS
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_TILT_EV_STATUS_NOT_DETECTED 		 = 0x00,
	LSM6DS3_TILT_EV_STATUS_DETECTED 		 = 0x20,
} LSM6DS3_TILT_EV_STATUS_t;

/*******************************************************************************
* Register      : FUNC_SRC
* Address       : 0X53
* Bit Group Name: SIGN_MOT_EV_STATUS
* Permission    : RO
*******************************************************************************/
typedef enum {
	LSM6DS3_SIGN_MOT_EV_STATUS_NOT_DETECTED 		 = 0x00,
	LSM6DS3_SIGN_MOT_EV_STATUS_DETECTED 		 = 0x40,
} LSM6DS3_SIGN_MOT_EV_STATUS_t;

/*******************************************************************************
* Register      : TAP_CFG1
* Address       : 0X58
* Bit Group Name: LIR
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_LIR_DISABLED 		 = 0x00,
	LSM6DS3_LIR_ENABLED 		 = 0x01,
} LSM6DS3_LIR_t;

