OleksiiTimofieiev/stm8s-discovery/i2c/LSM6.h
/*******************************************************************************
* Register      : TAP_CFG1
* Address       : 0X58
* Bit Group Name: TAP_Z_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_TAP_Z_EN_DISABLED 		 = 0x00,
	LSM6DS3_TAP_Z_EN_ENABLED 		 = 0x02,
} LSM6DS3_TAP_Z_EN_t;

/*******************************************************************************
* Register      : TAP_CFG1
* Address       : 0X58
* Bit Group Name: TAP_Y_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_TAP_Y_EN_DISABLED 		 = 0x00,
	LSM6DS3_TAP_Y_EN_ENABLED 		 = 0x04,
} LSM6DS3_TAP_Y_EN_t;

/*******************************************************************************
* Register      : TAP_CFG1
* Address       : 0X58
* Bit Group Name: TAP_X_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_TAP_X_EN_DISABLED 		 = 0x00,
	LSM6DS3_TAP_X_EN_ENABLED 		 = 0x08,
} LSM6DS3_TAP_X_EN_t;

/*******************************************************************************
* Register      : TAP_CFG1
* Address       : 0X58
* Bit Group Name: TILT_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_TILT_EN_DISABLED 		 = 0x00,
	LSM6DS3_TILT_EN_ENABLED 		 = 0x20,
} LSM6DS3_TILT_EN_t;

/*******************************************************************************
* Register      : TAP_CFG1
* Address       : 0X58
* Bit Group Name: PEDO_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_PEDO_EN_DISABLED 		 = 0x00,
	LSM6DS3_PEDO_EN_ENABLED 		 = 0x40,
} LSM6DS3_PEDO_EN_t;

/*******************************************************************************
* Register      : TAP_CFG1
* Address       : 0X58
* Bit Group Name: TIMER_EN
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_TIMER_EN_DISABLED 		 = 0x00,
	LSM6DS3_TIMER_EN_ENABLED 		 = 0x80,
} LSM6DS3_TIMER_EN_t;

/*******************************************************************************
* Register      : TAP_THS_6D
* Address       : 0X59
* Bit Group Name: TAP_THS
* Permission    : RW
*******************************************************************************/
#define  	LSM6DS3_TAP_THS_MASK  	0x1F
#define  	LSM6DS3_TAP_THS_POSITION  	0

/*******************************************************************************
* Register      : TAP_THS_6D
* Address       : 0X59
* Bit Group Name: SIXD_THS
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_SIXD_THS_80_degree 		 = 0x00,
	LSM6DS3_SIXD_THS_70_degree 		 = 0x20,
	LSM6DS3_SIXD_THS_60_degree 		 = 0x40,
	LSM6DS3_SIXD_THS_50_degree 		 = 0x60,
} LSM6DS3_SIXD_THS_t;

/*******************************************************************************
* Register      : INT_DUR2
* Address       : 0X5A
* Bit Group Name: SHOCK
* Permission    : RW
*******************************************************************************/
#define  	LSM6DS3_SHOCK_MASK  	0x03
#define  	LSM6DS3_SHOCK_POSITION  	0

/*******************************************************************************
* Register      : INT_DUR2
* Address       : 0X5A
* Bit Group Name: QUIET
* Permission    : RW
*******************************************************************************/
#define  	LSM6DS3_QUIET_MASK  	0x0C
#define  	LSM6DS3_QUIET_POSITION  	2

/*******************************************************************************
* Register      : INT_DUR2
* Address       : 0X5A
* Bit Group Name: DUR
* Permission    : RW
*******************************************************************************/
#define  	LSM6DS3_DUR_MASK  	0xF0
#define  	LSM6DS3_DUR_POSITION  	4

/*******************************************************************************
* Register      : WAKE_UP_THS
* Address       : 0X5B
* Bit Group Name: WK_THS
* Permission    : RW
*******************************************************************************/
#define  	LSM6DS3_WK_THS_MASK  	0x3F
#define  	LSM6DS3_WK_THS_POSITION  	0

/*******************************************************************************
* Register      : WAKE_UP_THS
* Address       : 0X5B
* Bit Group Name: INACTIVITY_ON
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INACTIVITY_ON_DISABLED 		 = 0x00,
	LSM6DS3_INACTIVITY_ON_ENABLED 		 = 0x40,
} LSM6DS3_INACTIVITY_ON_t;

/*******************************************************************************
* Register      : WAKE_UP_THS
* Address       : 0X5B
* Bit Group Name: SINGLE_DOUBLE_TAP
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_SINGLE_DOUBLE_TAP_DOUBLE_TAP 		 = 0x00,
	LSM6DS3_SINGLE_DOUBLE_TAP_SINGLE_TAP 		 = 0x80,
} LSM6DS3_SINGLE_DOUBLE_TAP_t;

/*******************************************************************************
* Register      : WAKE_UP_DUR
* Address       : 0X5C
* Bit Group Name: SLEEP_DUR
* Permission    : RW
*******************************************************************************/
#define  	LSM6DS3_SLEEP_DUR_MASK  	0x0F
#define  	LSM6DS3_SLEEP_DUR_POSITION  	0

/*******************************************************************************
* Register      : WAKE_UP_DUR
* Address       : 0X5C
* Bit Group Name: TIMER_HR
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_TIMER_HR_6_4ms 		 = 0x00,
	LSM6DS3_TIMER_HR_25us 		 = 0x10,
} LSM6DS3_TIMER_HR_t;

/*******************************************************************************
* Register      : WAKE_UP_DUR
* Address       : 0X5C
* Bit Group Name: WAKE_DUR
* Permission    : RW
*******************************************************************************/
#define  	LSM6DS3_WAKE_DUR_MASK  	0x60
#define  	LSM6DS3_WAKE_DUR_POSITION  	5

