OleksiiTimofieiev/stm8s-discovery/i2c/LSM6.h
/*******************************************************************************
* Register      : FREE_FALL
* Address       : 0X5D
* Bit Group Name: FF_DUR
* Permission    : RW
*******************************************************************************/
#define  	LSM6DS3_FF_FREE_FALL_DUR_MASK  	0xF8
#define  	LSM6DS3_FF_FREE_FALL_DUR_POSITION  	3
#define  	LSM6DS3_FF_WAKE_UP_DUR_MASK  	0x80
#define  	LSM6DS3_FF_WAKE_UP_DUR_POSITION  	7


/*******************************************************************************
* Register      : FREE_FALL
* Address       : 0X5D
* Bit Group Name: FF_THS
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_FF_THS_5 		 = 0x00,
	LSM6DS3_FF_THS_7 		 = 0x01,
	LSM6DS3_FF_THS_8 		 = 0x02,
	LSM6DS3_FF_THS_10 		 = 0x03,
	LSM6DS3_FF_THS_11 		 = 0x04,
	LSM6DS3_FF_THS_13 		 = 0x05,
	LSM6DS3_FF_THS_15 		 = 0x06,
	LSM6DS3_FF_THS_16 		 = 0x07,
} LSM6DS3_FF_THS_t;

/*******************************************************************************
* Register      : MD1_CFG
* Address       : 0X5E
* Bit Group Name: INT1_TIMER
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT1_TIMER_DISABLED 		 = 0x00,
	LSM6DS3_INT1_TIMER_ENABLED 		 = 0x01,
} LSM6DS3_INT1_TIMER_t;

/*******************************************************************************
* Register      : MD1_CFG
* Address       : 0X5E
* Bit Group Name: INT1_TILT
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT1_TILT_DISABLED 		 = 0x00,
	LSM6DS3_INT1_TILT_ENABLED 		 = 0x02,
} LSM6DS3_INT1_TILT_t;

/*******************************************************************************
* Register      : MD1_CFG
* Address       : 0X5E
* Bit Group Name: INT1_6D
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT1_6D_DISABLED 		 = 0x00,
	LSM6DS3_INT1_6D_ENABLED 		 = 0x04,
} LSM6DS3_INT1_6D_t;

/*******************************************************************************
* Register      : MD1_CFG
* Address       : 0X5E
* Bit Group Name: INT1_TAP
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT1_TAP_DISABLED 		 = 0x00,
	LSM6DS3_INT1_TAP_ENABLED 		 = 0x08,
} LSM6DS3_INT1_TAP_t;

/*******************************************************************************
* Register      : MD1_CFG
* Address       : 0X5E
* Bit Group Name: INT1_FF
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT1_FF_DISABLED 		 = 0x00,
	LSM6DS3_INT1_FF_ENABLED 		 = 0x10,
} LSM6DS3_INT1_FF_t;

/*******************************************************************************
* Register      : MD1_CFG
* Address       : 0X5E
* Bit Group Name: INT1_WU
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT1_WU_DISABLED 		 = 0x00,
	LSM6DS3_INT1_WU_ENABLED 		 = 0x20,
} LSM6DS3_INT1_WU_t;

/*******************************************************************************
* Register      : MD1_CFG
* Address       : 0X5E
* Bit Group Name: INT1_SINGLE_TAP
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT1_SINGLE_TAP_DISABLED 		 = 0x00,
	LSM6DS3_INT1_SINGLE_TAP_ENABLED 		 = 0x40,
} LSM6DS3_INT1_SINGLE_TAP_t;

/*******************************************************************************
* Register      : MD1_CFG
* Address       : 0X5E
* Bit Group Name: INT1_SLEEP
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT1_SLEEP_DISABLED 		 = 0x00,
	LSM6DS3_INT1_SLEEP_ENABLED 		 = 0x80,
} LSM6DS3_INT1_SLEEP_t;

/*******************************************************************************
* Register      : MD2_CFG
* Address       : 0X5F
* Bit Group Name: INT2_TIMER
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT2_TIMER_DISABLED 		 = 0x00,
	LSM6DS3_INT2_TIMER_ENABLED 		 = 0x01,
} LSM6DS3_INT2_TIMER_t;

/*******************************************************************************
* Register      : MD2_CFG
* Address       : 0X5F
* Bit Group Name: INT2_TILT
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT2_TILT_DISABLED 		 = 0x00,
	LSM6DS3_INT2_TILT_ENABLED 		 = 0x02,
} LSM6DS3_INT2_TILT_t;

/*******************************************************************************
* Register      : MD2_CFG
* Address       : 0X5F
* Bit Group Name: INT2_6D
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT2_6D_DISABLED 		 = 0x00,
	LSM6DS3_INT2_6D_ENABLED 		 = 0x04,
} LSM6DS3_INT2_6D_t;

/*******************************************************************************
* Register      : MD2_CFG
* Address       : 0X5F
* Bit Group Name: INT2_TAP
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT2_TAP_DISABLED 		 = 0x00,
	LSM6DS3_INT2_TAP_ENABLED 		 = 0x08,
} LSM6DS3_INT2_TAP_t;

/*******************************************************************************
* Register      : MD2_CFG
* Address       : 0X5F
* Bit Group Name: INT2_FF
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT2_FF_DISABLED 		 = 0x00,
	LSM6DS3_INT2_FF_ENABLED 		 = 0x10,
} LSM6DS3_INT2_FF_t;

/*******************************************************************************
* Register      : MD2_CFG
* Address       : 0X5F
* Bit Group Name: INT2_WU
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT2_WU_DISABLED 		 = 0x00,
	LSM6DS3_INT2_WU_ENABLED 		 = 0x20,
} LSM6DS3_INT2_WU_t;

