OleksiiTimofieiev/stm8s-discovery/i2c/LSM6.h
/*******************************************************************************
* Register      : MD2_CFG
* Address       : 0X5F
* Bit Group Name: INT2_SINGLE_TAP
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT2_SINGLE_TAP_DISABLED 		 = 0x00,
	LSM6DS3_INT2_SINGLE_TAP_ENABLED 		 = 0x40,
} LSM6DS3_INT2_SINGLE_TAP_t;

/*******************************************************************************
* Register      : MD2_CFG
* Address       : 0X5F
* Bit Group Name: INT2_SLEEP
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT2_SLEEP_DISABLED 		 = 0x00,
	LSM6DS3_INT2_SLEEP_ENABLED 		 = 0x80,
} LSM6DS3_INT2_SLEEP_t;


typedef enum
{
	XL_HM_MODE_EN=0x00,
	XL_HM_MODE_DS=0x10
}LSM6DS3_APF_t;

typedef enum
{
	G_HM_MODE_EN=0x00,
	G_HM_MODE_DS=0x80
}LSM6DS3_GPF_t;
/*******************************************************************************
* Register      : MD2_CFG
* Address       : 0X5F
* Bit Group Name: INT2_SLEEP
* Permission    : RW
*******************************************************************************/
typedef enum {
	LSM6DS3_INT_FLAG_FF_IA                         = 0x20,
	LSM6DS3_INT_FLAG_SLEEP_STATE_IA                = 0x10,
        LSM6DS3_INT_FLAG_WU_IA                         = 0x08,
        LSM6DS3_INT_FLAG_X_WU                          = 0x04,
        LSM6DS3_INT_FLAG_Y_WU                          = 0x02,
        LSM6DS3_INT_FLAG_Z_WU                          = 0x01
} LSM6DS3_INT_WAKE_UP_SRC_t;

typedef enum {
        LSM6DS3_INT_FLAG_TAP_IA                        = 0x40,
        LSM6DS3_INT_FLAG_SINGLE_TAP                    = 0x20,
        LSM6DS3_INT_FLAG_DOUBLE_TAP                    = 0x10,
        LSM6DS3_INT_FLAG_TAP_SIGN                      = 0x08,
        LSM6DS3_INT_FLAG_X_TAP                         = 0x04,
        LSM6DS3_INT_FLAG_Y_TAP                         = 0x02,
        LSM6DS3_INT_FLAG_Z_TAP                         = 0x01,
} LSM6DS3_INT_TAP_SRC_t;

typedef enum {
        LSM6DS3_INT_FLAG_D6D_IA                        = 0x40,
        LSM6DS3_INT_FLAG_ZH                            = 0x20,
        LSM6DS3_INT_FLAG_ZL                            = 0x10,
        LSM6DS3_INT_FLAG_YH                            = 0x08,
        LSM6DS3_INT_FLAG_YL                            = 0x04,
        LSM6DS3_INT_FLAG_XH                            = 0x02,
        LSM6DS3_INT_FLAG_XL                            = 0x01,
} LSM6DS3_INT_D6D_SRC_t;

typedef enum {
        LSM6DS3_INT_FUNC_STEP_COUNT_DELTA_IA           = 0x80,
        LSM6DS3_INT_FUNC_SIGN_MOTION_IA                = 0x40,
        LSM6DS3_INT_FUNC_TILT_IA                       = 0x20,
        LSM6DS3_INT_FUNC_STEP_DETECTED                 = 0x10,
        LSM6DS3_INT_FUNC_STEP_OVERFLOW                 = 0x08,
        LSM6DS3_INT_FUNC_SI_END_OP                     = 0x02,
        LSM6DS3_INT_FUNC_SENSORHUB_END_OP              = 0x01,
} LSM6DS3_INT_FUNC_SRC_t;


#define LSM6DS3_ACC_GYRO_IF_INC_MASK 0x04
#define LSM6DS3_ACC_GYRO_BDU_BLOCK_UPDATE 0x40


#define _180_DIV_PI 57.29

#define L_STAY_LIM  4547034
#define H_STAY_LIM 	151169041

#define FALL_LIM_L 10749798
#define FALL_LIM_H 419914001

#define LIM_GYRO 250
#define PER_POSTURE 500

typedef enum
{
	S_NULL=0,
	S_L_LIM=-10,
	S_H_LIM =10
}eBodyStateConst_t;

typedef enum
{
	NOT_ACT,
	ACT
}eHumanAct_t;

typedef enum
{
	VERT_S=0,
	GOR_BACK_S,
	GOR_STOM_S,
	GOR_LEFT_S,
	GOR_RIGHT_S,
	BODY_IN_ACT
}eHumanBodyState_t;
/*
typedef struct
{
	uint64_t anglX;
	uint64_t anglY;
	uint64_t anglZ;
	uint64_t mang;
	uint8_t LimFlagL;
	uint8_t LimFlagH;
}sAngleAc_t;
*/
typedef struct
{
	float anglX;
	float anglY;
	float anglZ;
	float mang;
	uint8_t gyroLimFall;
}sAngleGyro_t;

typedef struct
{
	uint16_t pedOld;
	uint16_t ped16;
	uint16_t period;
	uint8_t fall;
	uint8_t activity;
	uint8_t posture;
	uint8_t postureOld;
	uint8_t postureFlag;
	uint8_t pedRdy;
	uint8_t postureCnt;
	uint8_t postureArr[10];
}sBodyState_t;
/^
extern sBodyState_t BodyState;
extern sAngleAc_t g_AngleAc;
extern sAngleGyro_t AngleGyro;
*/
typedef struct
{
    float ax;
    float ay;
    float az;
    float gx;
    float gy;
    float gz;
    float T;
} MotionData;

typedef struct
{
    int16_t ax;
    int16_t ay;
    int16_t az;
} AccelRawData;

typedef struct
{
    int16_t gx;
    int16_t gy;
    int16_t gz;
} GyroRawData;

typedef struct
{
    float w;
    float x;
    float y;
    float z;
} Quaternion;

typedef struct
{
	float k1;
	float k2;
    int16_t ax;
    int16_t ay;
    int16_t az;
    int16_t gx;
    int16_t gy;
    int16_t gz;
    int16_t T;
} ImuRawData;

/*============================================================================
Prototypes
============================================================================*/
status_t getIMUDeviceID(uint8_t* id);
status_t resetIMU();
status_t initIMU();
status_t calibrateLSM6DS3();

status_t initGyro();
status_t initAccel();
status_t initPed();
status_t resetPed(void);
status_t initInterrupts();
void getIMUInterruptSource(uint8_t* interruptSrc);

status_t setAccelBW(LSM6DS3_BW_XL_t bw);
status_t setAccelODR(LSM6DS3_ODR_XL_t rate);
status_t setGyroODR(LSM6DS3_ODR_G_t rate);
status_t setAccelRange(LSM6DS3_FS_XL_t range);
status_t setGyroRange(LSM6DS3_FS_G_t range);
status_t setAccelPerfMode(LSM6DS3_APF_t bw);
status_t setGyroPerfMode(LSM6DS3_GPF_t bw);
status_t getMotionT(MotionData* motionData);

float calculateTemperature(int16_t rawInput);
float calculateAcceleration(int16_t rawInput);
float calculateRotation(int16_t rawInput);

status_t getRawMotionT(ImuRawData* imu);

status_t getRawAcceleration(int16_t* ax, int16_t* ay, int16_t* az);
status_t getRawRotation(int16_t* gx, int16_t* gy, int16_t* gz);
status_t getRawPedometer(uint16_t *gz);
status_t getRawTemperature(int16_t *t);
status_t getRawAccelerationX(int16_t *ax);
status_t getRawAccelerationY(int16_t *ay);
status_t getRawAccelerationZ(int16_t *az);
status_t getRawRotationX(int16_t *gx);
status_t getRawRotationY(int16_t *gy);
status_t getRawRotationZ(int16_t *gz);

status_t sleeptAccel();

extern MotionData motionDataF;
extern ImuRawData RawData;
uint16_t LSM6_GetPin(LSM6_pin_en _LSM6_pin_name);
void LSM6__SetPin(LSM6_pin_en ADS1292_pin_name, eLSM6_Bit_State_t BitVal);
status_t initLSMReg();

void LSM6_CalcAngleAc(void);
void LSM6_AnalyseCardiomoPos(void);
void LSM6_GetPedometerData(void);
uint8_t LSM6_BodyStateDetection(void);
#endif /* LSM6_INC_LSM6_H_ */
